/*
 Задание 1. Написать программу, в которой создаются объекты различных классов и
помещаются в массив, после чего массив просматривается.
Каждый разрабатываемый класс должен содержать следующие элементы:
скрытые поля, конструкторы с параметрами и без параметров, методы; свойства, индексаторы;
перегруженные операции. Функциональные элементы класса должны обеспечивать
непротиворечивый, полный, минимальный и удобный интерфейс класса.
Использовать для хранения экземпляров разработанных классов стандартные
параметризованные коллекции. Во всех классах реализовать интерфейс IComparable и
перегрузить операции отношения для реализации значимой семантики сравнения объектов по
какому-либо полю на усмотрение студента.

8) Место, область, город, мегаполис

Задание 2. Для классов, разработанных в задании 1, реализовать работу со следующей
обобщенной коллекцией: Очередь.
*/
namespace ConsoleApp1
{
    public class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
